#!/usr/bin/env python
"""Copyright 2025 evdcush."""

import argparse
import pyperclip



BOLD_MAP = {
    '0': '𝟬',
    '1': '𝟭',
    '2': '𝟮',
    '3': '𝟯',
    '4': '𝟰',
    '5': '𝟱',
    '6': '𝟲',
    '7': '𝟳',
    '8': '𝟴',
    '9': '𝟵',
    'a': '𝗮',
    'b': '𝗯',
    'c': '𝗰',
    'd': '𝗱',
    'e': '𝗲',
    'f': '𝗳',
    'g': '𝗴',
    'h': '𝗵',
    'i': '𝗶',
    'j': '𝗷',
    'k': '𝗸',
    'l': '𝗹',
    'm': '𝗺',
    'n': '𝗻',
    'o': '𝗼',
    'p': '𝗽',
    'q': '𝗾',
    'r': '𝗿',
    's': '𝘀',
    't': '𝘁',
    'u': '𝘂',
    'v': '𝘃',
    'w': '𝘄',
    'x': '𝘅',
    'y': '𝘆',
    'z': '𝘇',
    'A': '𝗔',
    'B': '𝗕',
    'C': '𝗖',
    'D': '𝗗',
    'E': '𝗘',
    'F': '𝗙',
    'G': '𝗚',
    'H': '𝗛',
    'I': '𝗜',
    'J': '𝗝',
    'K': '𝗞',
    'L': '𝗟',
    'M': '𝗠',
    'N': '𝗡',
    'O': '𝗢',
    'P': '𝗣',
    'Q': '𝗤',
    'R': '𝗥',
    'S': '𝗦',
    'T': '𝗧',
    'U': '𝗨',
    'V': '𝗩',
    'W': '𝗪',
    'X': '𝗫',
    'Y': '𝗬',
    'Z': '𝗭'
}

BOLD_MAP_ORD = {
    48: '𝟬',
    49: '𝟭',
    50: '𝟮',
    51: '𝟯',
    52: '𝟰',
    53: '𝟱',
    54: '𝟲',
    55: '𝟳',
    56: '𝟴',
    57: '𝟵',
    97: '𝗮',
    98: '𝗯',
    99: '𝗰',
    100: '𝗱',
    101: '𝗲',
    102: '𝗳',
    103: '𝗴',
    104: '𝗵',
    105: '𝗶',
    106: '𝗷',
    107: '𝗸',
    108: '𝗹',
    109: '𝗺',
    110: '𝗻',
    111: '𝗼',
    112: '𝗽',
    113: '𝗾',
    114: '𝗿',
    115: '𝘀',
    116: '𝘁',
    117: '𝘂',
    118: '𝘃',
    119: '𝘄',
    120: '𝘅',
    121: '𝘆',
    122: '𝘇',
    65: '𝗔',
    66: '𝗕',
    67: '𝗖',
    68: '𝗗',
    69: '𝗘',
    70: '𝗙',
    71: '𝗚',
    72: '𝗛',
    73: '𝗜',
    74: '𝗝',
    75: '𝗞',
    76: '𝗟',
    77: '𝗠',
    78: '𝗡',
    79: '𝗢',
    80: '𝗣',
    81: '𝗤',
    82: '𝗥',
    83: '𝗦',
    84: '𝗧',
    85: '𝗨',
    86: '𝗩',
    87: '𝗪',
    88: '𝗫',
    89: '𝗬',
    90: '𝗭'
}

def to_bold(input_string):
    assert type(input_string) == str, print(f'received {type(input_string) = }')
    return input_string.translate(BOLD_MAP_ORD)

def main():
    parser = argparse.ArgumentParser()
    parser.add_argument(
        'text',
        nargs='*',
        type=str,
        help='Text to BOLDIFY!'
    )

    args = parser.parse_args()

    text = ' '.join(args.text)
    bold_text = to_bold(text)
    print(bold_text)
    pyperclip.copy(bold_text)


if __name__ == '__main__':
    main()
